{
  "projects": [
    {
      "name": "CodePen Experiments",
      "url": "https://codepen.io/justinryder",
      "description": "I use CodePen to experiment with new web tech and to create reduced test cases. All of my pens are publicly available."
    },
    {
      "name": "GitHub Projects",
      "url": "https://github.com/justinryder",
      "description": "Whenever possible, I host all of my projects publicly on GitHub. I love coding in hackathons so there is no shortage of hastily built, but super fun projects there."
    },
    {
      "name": "Encounter Builder",
      "url": "/projects/encounter-builder.html",
      "description": "Plan your D&D encounters with automatic difficulty calculation using the 5e rules! Search the entire D&D Beyond monster database to craft the perfect encounter for your players. Can you find the hidden easter eggs?"
    },
    {
      "name": "Combat Tracker",
      "url": "/projects/combat-tracker.html",
      "description": "Run your planned or ad-hoc encounters with full initiative, turn, round, HP tracking, and quick monster stat lookup!"
    },
    {
      "name": "Twitch Extension",
      "url": "/projects/ddb-twitch-extension.html",
      "description": "Show off your D&D Beyond characters with this beautiful, scalable stream overlay! With real-time health, condition, and equipment tracking"
    },
    {
      "name": "MTG Deck Builder",
      "url": "/projects/mtgs-deckbuilder.html",
      "description": "Build, plan, share, and test your Magic: The Gathering decks."
    },
    {
      "name": "Baby Boomer",
      "url": "/projects/baby-boomer.html",
      "description": "Can AngularJS be used to create an infinite scroller? Yes. Should it? No. But I did it anyways! Play as a lost baby navigating the infinite aisles of a grocery store, dodging tipped carts and more."
    },
    {
      "name": "Armadyne",
      "url": "/projects/armadyne.html",
      "description": "Play as an Armadyne, an armadillo/porcupine hybrid, and race to victory! Use your hardened shell to race at insane speeds, then use your spikes to scale walls! Collect power-ups to disadvantage your opponents and win!"
    },
    {
      "name": "Omni-Shelf",
      "url": "https://youtu.be/ly6n3BWXvtQ",
      "description": "What if you could go grocery shopping without leaving the comfort of your own home? In this 2 day hackathon, my team explored ways to build a VR shopping experience that brings the store shelves to your VR world. While we're in VR, we might as well shop in the forest or on a mountain or in Skyrim."
    },
    {
      "name": "Physics Engine",
      "url": "/projects/physics-engine.html",
      "description": "I built a physics engine with C++ and DirectX and uploaded some of the more ridiculous demos to YouTube. Like when I used it to build a Newton's cradle, an overly interconnected cube of springs, or even the Solar System."
    }
  ]
}
